---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorLength
source: html/0baf4b06-8b5c-305b-a5d2-c7cbbee43242.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemAnchorLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemAnchorLength { get; }
```